/**
 * Created by sf on 2017/12/23.
 */

// 14、Promise对象
console.log('\n\n');
console.log('---------------------------------------');
console.log('------ 14、Promise对象（开始）-----------');
console.log('---------------------------------------');

console.log('--- 1、Promise的含义 ---------');
console.log('所谓Promise，就是一个容器，保存着某个未来才会结束的事件的结果');


console.log('---------------------------------------');
console.log('------ 14、Promise对象（结束）-----------');
console.log('---------------------------------------');
